In [10]:
import pandas as pd
import numpy as np

In [11]:
a=pd.read_csv('kohli_ipl.csv',index_col='match_no')
a

          runs
match_no
1            1
2           23
3           13
4           12
5            1
...        ...
211          0
212         20
213         73
214         25
215          7

[215 rows x 1 columns]

In [12]:
a=a.squeeze()

In [13]:
a

match_no
1       1
2      23
3      13
4      12
5       1
       ..
211     0
212    20
213    73
214    25
215     7
Name: runs, Length: 215, dtype: int64

In [20]:
a[10:17]

match_no
11    10
12    38
13     3
14    11
15    50
16     2
17    22
Name: runs, dtype: int64

In [27]:
a[:-5:-1]

match_no
215     7
214    25
213    73
212    20
Name: runs, dtype: int64

In [30]:
a[11:12]

match_no
12    38
Name: runs, dtype: int64

In [32]:
b=pd.read_csv('subs.csv')
b

     Subscribers gained
0                    48
1                    57
2                    40
3                    43
4                    44
..                  ...
360                 231
361                 226
362                 155
363                 144
364                 172

[365 rows x 1 columns]

In [36]:
b[0:15]
b[-12:-7]

     Subscribers gained
353                 197
354                 204
355                 149
356                 156
357                 177

In [37]:
b[345:346]

     Subscribers gained
345                 258

In [38]:
c=pd.read_csv('bollywood.csv',index_col='movie')
c

                                                  lead
movie
Uri: The Surgical Strike                 Vicky Kaushal
Battalion 609                              Vicky Ahuja
The Accidental Prime Minister (film)       Anupam Kher
Why Cheat India                          Emraan Hashmi
Evening Shadows                       Mona Ambegaonkar
...                                                ...
Company (film)                              Ajay Devgn
Awara Paagal Deewana                      Akshay Kumar
Pushpa:2                                    Allu Arjun
Housefull -5                              Akshay Kumar
Raid 2                                      Ajay Devgn

[1503 rows x 1 columns]

In [42]:
c.squeeze()

movie
Uri: The Surgical Strike                   Vicky Kaushal
Battalion 609                                Vicky Ahuja
The Accidental Prime Minister (film)         Anupam Kher
Why Cheat India                            Emraan Hashmi
Evening Shadows                         Mona Ambegaonkar
                                              ...
Company (film)                                Ajay Devgn
Awara Paagal Deewana                        Akshay Kumar
Pushpa:2                                      Allu Arjun
Housefull -5                                Akshay Kumar
Raid 2                                        Ajay Devgn
Name: lead, Length: 1503, dtype: object

In [43]:
c[44:50]
c[-55:-45]

                                        lead
movie
Ishq Vishk                     Shahid Kapoor
Hawayein                          Babbu Mann
Jajantaram Mamantaram          Javed Jaffrey
Jism (2003 film)                Bipasha Basu
Jhankaar Beats                   Sanjay Suri
Kagaar: Life on the Edge             Om Puri
Kash Aap Hamare Hote             Juhi Babbar
Khel – No Ordinary Game           Sunny Deol
Janasheen                         Feroz Khan
Kaise Kahoon Ke... Pyaar Hai  Amit Hingorani

In [47]:
a[1]

np.int64(1)

In [ ]:
b[1]

In [ ]:
c[1]